nguyentri/da-pac/svd/DA14531.svd
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDC_DTCIN_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_ATTR_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>PWR_MODE_TX</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PWR_MODE_RX</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_CN_CTRL_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x09620100</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CH0</name>
	
	<bitRange>[28:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SGN</name>
	
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CS</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CN</name>
	
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_DCOAMP_CAL_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x77770011</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>DCOAMPIC_LP_TX</name>
	
	<bitRange>[31:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPIC_LP_RX</name>
	
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPIC_HP_TX</name>
	
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPIC_HP_RX</name>
	
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCOAMPTM</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AMPCALEN</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KMEDIUM</name>
	
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>KCOARSE</name>
	
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_DCO_RD_REG</name>
	
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1c000007</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>DCOAMP</name>
	
	<bitRange>[29:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOMOD</name>
	
	<bitRange>[25:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOFINE</name>
	
	<bitRange>[12:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOMEDIUM</name>
	
	<bitRange>[6:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCOCOARSE</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_DIV_CTRL_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0198ff03</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TXDIV_TRIM</name>
	
	<bitRange>[25:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDIV_TRIM</name>
	
	<bitRange>[16:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDIV_FB_EN_TX</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RXDIV_FB_EN_RX</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FBDIV_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_FIF_CTRL1_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FIFRX_1M</name>
	
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_FIF_CTRL2_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>FIFTX</name>
	
	<bitRange>[29:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FIFRX_OFFSET</name>
	
	<bitRange>[13:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ADPLL_FREQMEAS_RD_REG</name>
	
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x21000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>MEASDONE_OUT</name>
	
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>QUALMONDET</name>
	
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TDCBUB</name>
	
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PHVSA0</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PHVSA1</name>
	
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQDIFF</name>
	
	<bitRange>[22:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>ADPLL_FSM_CTRL_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x08f8ae84</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>TVPASETTLE</name>
	
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TSETTLE</name>
	
	<bitRange>[23:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TPASETTLE</name>
	
	<bitRange>[19:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TMOD</name>
	
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TFINE</name>
	
