nguyentri/da-pac/svd/DA14531.svd
</register><register>
	<name>GP_ADC_PARAM_SE_REG</name>
	
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000000</resetMask>
	
</register><register>
	<name>GP_ADC_RESULT_REG</name>
	<description>General Purpose ADC Result Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>GP_ADC_VAL</name>
	<description>Returns the 10 up to 16 bits linear value of the last AD conversion. The upper 10 bits are always valid, the lower 6 bits are only valid in case oversampling has been applied. Two samples results in one extra bit and 64 samples results in six extra bits.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>GP_ADC_TRIM_REG</name>
	<description>General Purpose ADC Trim Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000038</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
	<name>GP_ADC_LDO_LEVEL</name>
	<description>GPADC LDO level
0: 825mV
1: 850mV
2: 875mV
3: 900mV (reset)
4: 925mV (default)
5: 950mV
6: 975mV
7:1000mV</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>GP_ADC_OFFS_SH_VREF</name>
	<description>Offset Shifter common-mode reference fine trimming: 2mV/LSB
Default = mid-scale at 1000</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>GPIO</name>
	<version>1.0</version>
	<description>GPIO registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50003000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>66</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>BIST_CTRL_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000480</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SYSRAM3_BIST_ENABLE</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM_BIST_PATTERN</name>
	
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYSRAM12_BIST_BUSY</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYSRAM12_BIST_FAIL</name>
	
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYSRAM3_BIST_BUSY</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYSRAM3_BIST_FAIL</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ROM_BIST_BUSY</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SYSRAM12_BIST_ENABLE</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ROMBIST_ENABLE</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM_BIST_CONFIG</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P00_MODE_REG</name>
	<description>P00 Mode Register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>Function of port
0  =  GPIO (pin direction determined by &quot;PUPD&quot; field)
1  =  UART1_RX
2  =  UART1_TX
3  =  UART2_RX
4  =  UART2_TX
5  =  SYS_CLK
6  =  LP_CLK
7  =  Reserved
8  =  Reserved
9  =  I2C_SCL
10 = I2C_SDA
11 = PWM5
12 = PWM6
13 = PWM7
14 = Reserved
15 = ADC (only for P0_1, P0_2, P0_6 and P0_7)
16 = PWM0
17 = PWM1
18 = BLE_DIAG (signals mapped to P0[3:0] are also mapped to P0[11:8])
19 = UART1_CTSN
20 = UART1_RTSN
21 = Reserved
22 = Reserved
23 = PWM2
24 = PWM3
25 = PWM4
26 = SPI_DI
27 = SPI_DO
28 = SPI_CLK
29 = SPI_CSN0
30 = SPI_CSN1
31 = Reserved
Note: When a certain input function (like SPI_DI) is selected on more than 1 pins, the pin of the lowest index has the highest priority.</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P010_MODE_REG</name>
	<description>P010 Mode Register</description>
	<addressOffset>0x0000001a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P011_MODE_REG</name>
	<description>P011 Mode Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P01_MODE_REG</name>
	<description>P01 Mode Register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P02_MODE_REG</name>
	<description>P02 Mode Register</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P03_MODE_REG</name>
	<description>P03 Mode Register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
In ADC mode, these bits are don't care </description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P04_MODE_REG</name>
	<description>P04 Mode Register</description>
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected
</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P05_MODE_REG</name>
	<description>P05 Mode Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P06_MODE_REG</name>
	<description>P06 Mode Register</description>
	<addressOffset>0x00000012</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P07_MODE_REG</name>
	<description>P07 Mode Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P08_MODE_REG</name>
	<description>P08 Mode Register</description>
	<addressOffset>0x00000016</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P09_MODE_REG</name>
	<description>P09 Mode Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PUPD</name>
	<description>00 = Input, no resistors selected
01 = Input, pull-up selected
10 = Input, pull-down selected
11 = Output, no resistors selected</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PID</name>
	<description>See P00_MODE_REG[PID]</description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P0_DATA_REG</name>
	<description>P0 Data input/output Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P0_DATA</name>
	<description>Sets P0 output register when written ; Returns the value of P0 port when read </description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>P0_RESET_DATA_REG</name>
	<description>P0 Reset port pins Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P0_RESET</name>
	<description>Writing a 1 to P0[x] sets P0[x] to 0.
Writing 0 is discarded, reading returns 0.</description>
	<bitRange>[11:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>P0_SET_DATA_REG</name>
	<description>P0 Set port pins Register</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>P0_SET</name>
	<description>Writing a 1 to P0[x] sets P0[x] to 1.
Writing 0 is discarded, reading returns 0 </description>
	<bitRange>[11:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>PAD_WEAK_CTRL_REG</name>
	<description>Pad driving strength control Register</description>
	<addressOffset>0x0000001e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PAD_LOW_DRV</name>
	<description>0 = Normal operation
1 = Reduces the driving strength of P0_x pad.
Bit x controls the driving strength of P0_x, x=0, 1,..., 11.</description>
	<bitRange>[11:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>ROMBIST_RESULTH_REG</name>
	
