nguyentri/da-pac/svd/DA14531.svd
	<bitRange>[17:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR2_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR3_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR4_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR5_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR6_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR7_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR8_REG</name>
	
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_ADDR9_REG</name>
	
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x07f00000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_ADDR_19</name>
	
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PATCH_ADDR_C</name>
	
	<bitRange>[17:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_DATA20_REG</name>
	
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_DATA</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_DATA21_REG</name>
	
	<addressOffset>0x000000cc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_DATA</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PATCH_VALID_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>PATCH_VALID</name>
	
	<bitRange>[21:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QUADEC</name>
	<version>1.0</version>
	<description>QUADEC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000200</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>14</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>QDEC_CLOCKDIV_REG</name>
	<description>Clock divider register</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000003e7</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>QDEC_PRESCALER_EN</name>
	<description>0 = no prescaler enabled
1 = in sleep and active mode, quadrature clock is divided by 2</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CLOCKDIV</name>
	<description>Contains the number of the input clock cycles minus one, that are required to generate one logic clock cycle.
Clock divider is bypassed when system runs at LP_CLK</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_CTRL2_REG</name>
	<description>Quad Decoder port selection register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000ed1</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>QDEC_CHZ_EVENT_MODE</name>
	<description>0 = Normal quadrature counting
1 = Counts rising and falling edge of both ports (if both ports change at the same time, counter increases by 1)</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHY_EVENT_MODE</name>
	<description>0 = Normal quadrature counting
1 = Counts rising and falling edge of both ports (if both ports change at the same time, counter increases by 1)</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHX_EVENT_MODE</name>
	<description>0 = Normal quadrature counting
1 = Counts rising and falling edge of both ports (if both ports change at the same time, counter increases by 1)</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHZ_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel Z
0: none
1: P0[2] -&gt; CHZ_A, P0[5] -&gt; CHZ_B
2: P0[1] -&gt; CHZ_A, P0[4] -&gt; CHZ_B
3: P0[3] -&gt; CHZ_A, P0[10] -&gt; CHZ_B
4: P0[6] -&gt; CHZ_A, P0[7] -&gt; CHZ_B
5: P0[8] -&gt; CHZ_A, P0[9] -&gt; CHZ_B
6: P0[0] -&gt; CHZ_A, P0[11] -&gt; CHZ_B
7: none</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHY_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel Y
0: none
1: P0[2] -&gt; CHY_A, P0[5] -&gt; CHY_B
2: P0[1] -&gt; CHY_A, P0[4] -&gt; CHY_B
3: P0[3] -&gt; CHY_A, P0[10] -&gt; CHY_B
4: P0[6] -&gt; CHY_A, P0[7] -&gt; CHY_B
5: P0[8] -&gt; CHY_A, P0[9] -&gt; CHY_B
6: P0[0] -&gt; CHY_A, P0[11] -&gt; CHY_B
7: none</description>
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_CHX_PORT_SEL</name>
	<description>Defines which GPIOs are mapped on Channel X
0: none
1: P0[2] -&gt; CHX_A, P0[5] -&gt; CHX_B
2: P0[1] -&gt; CHX_A, P0[4] -&gt; CHX_B
3: P0[3] -&gt; CHX_A, P0[10] -&gt; CHX_B
4: P0[6] -&gt; CHX_A, P0[7] -&gt; CHX_B
5: P0[8] -&gt; CHX_A, P0[9] -&gt; CHX_B
6: P0[0] -&gt; CHX_A, P0[11] -&gt; CHX_B
7: none</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_CTRL_REG</name>
	<description>Quad Decoder control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000011</resetValue>
	<resetMask>0x000007ff</resetMask>
	<fields><field>
	<name>QDEC_IRQ_THRES</name>
	<description>Defines the number of events on either counter (X or Y or Z) that need to be reached before an interrupt is generated. Events are equal to QDEC_IRQ_THRES+1.</description>
	<bitRange>[10:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_IRQ_STATUS</name>
	<description>1 = Interrupt is occured.
0 = No interrupt pending
Write 1 will clear the pending interrupt </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_EVENT_CNT_CLR</name>
	<description>Writing 1 QDEC_EVENT_CNT_REG is cleared</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QDEC_IRQ_ENABLE</name>
	<description>0 = interrupt is masked
1 = interrupt is enabled </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QDEC_EVENT_CNT_REG</name>
	<description>Event counter register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>QDEC_EVENT_CNT</name>
	<description>Gives the number of events at all channels.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_XCNT_REG</name>
	<description>Counter value of the X Axis</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QDEC_X_CNT</name>
	<description>Contains a signed value of the events. Zero when channel is disabled </description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_YCNT_REG</name>
	<description>Counter value of the Y Axis</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QDEC_Y_CNT</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>QDEC_ZCNT_REG</name>
	<description>Counter value of the Z Axis</description>
	<addressOffset>0x0000000a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>QDEC_Z_CNT</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFCU</name>
	<version>1.0</version>
	<description>RFCU registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x40001000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>188</size>
	<usage>registers</usage>
</addressBlock>
	
