nguyentri/da-pac/svd/DA14531.svd
	<registers>
	<register>
	<name>RF_ADCI_DC_OFFSET_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_I_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADC_OFFP_I_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_ADCQ_DC_OFFSET_REG</name>
	
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020100</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_Q_RD</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADC_OFFP_Q_RD</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_ADC_CTRL1_REG</name>
	
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00006001</resetMask>
	<fields><field>
	<name>ADC_SIGN</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_MUTE</name>
	
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_DC_OFFSET_SEL</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADC_CTRL2_REG</name>
	
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_I_WR</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_OFFP_I_WR</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADC_CTRL3_REG</name>
	
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>ADC_OFFN_Q_WR</name>
	
	<bitRange>[17:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADC_OFFP_Q_WR</name>
	
	<bitRange>[8:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADPLLDIG_CTRL_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x00000073</resetMask>
	<fields><field>
	<name>PWR_SW_TIM_CTRL</name>
	
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OPENLOOP_RDY_WR</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>OPENLOOP_RDY_SEL</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ADPLLDIG_RFMON_CTRL_REG</name>
	
	<addressOffset>0x000000a0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>ADPLLDIG_RFMON_SPARE</name>
	
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_RFMON_MUX_SEL</name>
	
	<bitRange>[3:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADPLLDIG_SYNC_CLK_INV</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_AGC_EXT_LUT_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields><field>
	<name>AGC_EXT_LUT</name>
	
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_ATTR_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0c000820</resetValue>
	<resetMask>0x0f001f28</resetMask>
	<fields><field>
	<name>PA_POWER_SETTING</name>
	
	<bitRange>[27:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIA_BIAS</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_BIAS</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_POLARITY</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CALSTATE_REG</name>
	
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CALSTATE</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_CAL_CTRL_REG</name>
	
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000017</resetMask>
	<fields><field>
	<name>DC_OFFSET_CAL_DIS</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_CAL_CTRL_SPARE</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EO_CAL</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SO_CAL</name>
	
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>RF_DIAGIRQ_CTRL_REG</name>
	
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7f7f7f7f</resetMask>
	<fields><field>
	<name>DIAG_BUS3_EDGE_SEL</name>
	
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS3_BIT_SEL</name>
	
	<bitRange>[29:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS3_SEL</name>
	
	<bitRange>[26:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS3_IRQ_MASK</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_EDGE_SEL</name>
	
	<bitRange>[22:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_BIT_SEL</name>
	
