nguyentri/da-pac/svd/DA14531.svd
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_SEL</name>
	
	<bitRange>[18:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS2_IRQ_MASK</name>
	
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_EDGE_SEL</name>
	
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_BIT_SEL</name>
	
	<bitRange>[13:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_SEL</name>
	
	<bitRange>[10:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS1_IRQ_MASK</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_EDGE_SEL</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_BIT_SEL</name>
	
	<bitRange>[5:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_SEL</name>
	
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DIAG_BUS0_IRQ_MASK</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_DIAGIRQ_STAT_REG</name>
	
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>DIAGIRQ_STAT</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_IFF_CTRL_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x00007ff3</resetMask>
	<fields><field>
	<name>IFF_DCOC_DAC_REFCUR_CTRL</name>
	
	<bitRange>[14:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_COMPLEX_DIS</name>
	
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_IFF_CTRL_SPARE</name>
	
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IFF_DCOC_DAC_DIS</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IF_MUTE</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IF_CAL_TRIM</name>
	
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_IO_CTRL_REG</name>
	
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000100</resetValue>
	<resetMask>0x00000f0f</resetMask>
	<fields><field>
	<name>RFIO_TUNE_CAP_TRIM_TX</name>
	
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RFIO_TUNE_CAP_TRIM_RX</name>
	
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_IRQ_CTRL_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>EO_CAL_CLEAR</name>
	
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>RF_LDO_CTRL_REG</name>
	
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00190333</resetValue>
	<resetMask>0x3f1f0fff</resetMask>
	<fields><field>
	<name>LDO_DCO_HOLD_OVR_EN</name>
	
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DCO_HOLD_OVR_VAL</name>
	
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_HOLD_OVR_EN</name>
	
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_HOLD_OVR_VAL</name>
	
	<bitRange>[26:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_HOLD_OVR_EN</name>
	
	<bitRange>[25:25]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_HOLD_OVR_VAL</name>
	
	<bitRange>[24:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VREF_SMPL_TIME</name>
	
	<bitRange>[20:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DCO_CONT_ENABLE</name>
	
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DCO_LEVEL</name>
	
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_CONT_ENABLE</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_DTC_LEVEL</name>
	
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_CONT_ENABLE</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_RADIO_LEVEL</name>
	
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_LDO_STATUS_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>ldo_dtc_vref_hold_rd</name>
	
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_dco_vref_hold_rd</name>
	
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_radio_vref_hold_rd</name>
	
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_dtc_en_rd</name>
	
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ldo_dco_en_rd</name>
	
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADPLLDIG_LDO_ZERO_EN_RD</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ADPLLDIG_LDO_EN_RD</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_LDO_ZERO_EN_RD</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RADIO_LDO_EN_RD</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RF_LDO_VREF_SEL_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>RF_LDO_DCO_VREF_SEL</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RF_LDO_DTC_VREF_SEL</name>
	
