nguyentri/da-pac/svd/DA14531.svd
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_CAL_EN</name>
	
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_LOBUF_PA_EN</name>
	
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLL_PAIN_EN</name>
	
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ALW_EN_ADPLLDIG_RX_EN</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_10_REG</name>
	
	<addressOffset>0x00000124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000c16</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_11_REG</name>
	
	<addressOffset>0x00000128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000081a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_12_REG</name>
	
	<addressOffset>0x0000012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000e1a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_13_REG</name>
	
	<addressOffset>0x00000130</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000220</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_14_REG</name>
	
	<addressOffset>0x00000134</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000a20</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_15_REG</name>
	
	<addressOffset>0x00000138</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000426</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_16_REG</name>
	
	<addressOffset>0x0000013c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000430</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_17_REG</name>
	
	<addressOffset>0x00000140</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000837</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_18_REG</name>
	
	<addressOffset>0x00000144</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000846</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_19_REG</name>
	
	<addressOffset>0x00000148</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000850</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_1_REG</name>
	
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000400</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_20_REG</name>
	
	<addressOffset>0x0000014c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000125a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_21_REG</name>
	
	<addressOffset>0x00000150</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_22_REG</name>
	
	<addressOffset>0x00000154</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_23_REG</name>
	
	<addressOffset>0x00000158</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>RESET_OFFSET</name>
	
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SET_OFFSET</name>
	
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RF_CNTRL_TIMER_24_REG</name>
	
