nguyentri/da-pac/svd/DA14531.svd
	<registers>
	<register>
	<name>TIMER1_CAPCNT1_VALUE_REG</name>
	<description>Timer1 value for event on GPIO1</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x003fffff</resetMask>
	<fields><field>
	<name>TIMER1_CAPCNT1_RTC_HIGH</name>
	<description>In Counter mode : Not used
In Capture mode: Gives the RTC time stamp (high part) when an IN1 event was occurred </description>
	<bitRange>[21:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_CAPCNT1_VALUE</name>
	<description>In Counter mode : Gives the number of timer clock cycles minus 1 which was measured during TIMER1_IN1_PERIOD_MAX periods of IN1
In Capture mode (TIMER1_IN1_STAMP_TYPE=0) : Gives the Counter value when an IN1 event was occurred
In Capture mode (TIMER1_IN1_STAMP_TYPE=1) : Gives the RTC time stamp (low part) when an IN1 event was occurred </description>
	<bitRange>[10:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER1_CAPCNT2_VALUE_REG</name>
	<description>Timer1 value for event on GPIO2</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x003fffff</resetMask>
	<fields><field>
	<name>TIMER1_CAPCNT2_RTC_HIGH</name>
	<description>In Counter mode : Not used
In Capture mode: Gives the RTC time stamp (high part) when an IN2 event was occurred </description>
	<bitRange>[21:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_CAPCNT2_VALUE</name>
	<description>In Counter mode : Gives the number of timer clock cycles minus 1 which was measured during TIMER1_IN2_PERIOD_MAX periods of IN2
In Capture mode (TIMER1_IN2_STAMP_TYPE=0) : Gives the Counter value when an IN2 event was occurred
In Capture mode (TIMER1_IN2_STAMP_TYPE=1) : Gives the RTC time stamp (low part) when an IN2 event was occurred </description>
	<bitRange>[10:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER1_CAPTURE_REG</name>
	<description>Timer1 Capture control register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0fffffff</resetMask>
	<fields><field>
	<name>TIMER1_IN2_STAMP_TYPE</name>
	<description>0 = On each event store the counter value
1 = On each event store the RTC time stamp</description>
	<bitRange>[27:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN2_PERIOD_MAX</name>
	<description>Gives the number of periods +1 of IN2, in which module counts</description>
	<bitRange>[26:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN2_IRQ_EN</name>
	<description>1 = Interrupt is generated when capture is occurred or was counted TIMER1_IN2_PERIOD_MAX
0 = Interrupt is masked</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN2_COUNT_EN</name>
	<description>0 = Capture mode
1 = Count mode</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN2_EVENT_FALL_EN</name>
	<description>0 = Rising edge event
1 = Falling edge event
it should be written when TIMER1_GPIO2_CONF=0 to prevent false events</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_GPIO2_CONF</name>
	<description>0,13,14,15 = IN2 is not used
1..12 = Defines the P0 pin (0..11) module will use as IN2</description>
	<bitRange>[17:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN1_STAMP_TYPE</name>
	<description>0 = On each event store the counter value
1 = On each event store the RTC time stamp</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN1_PERIOD_MAX</name>
	<description>Gives the number of periods +1 of IN1, in which module counts</description>
	<bitRange>[12:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN1_IRQ_EN</name>
	<description>1 = Interrupt is generated when capture is occurred or was counted TIMER1_IN1_PERIOD_MAX
0 = Interrupt is masked</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN1_COUNT_EN</name>
	<description>0 = Capture mode
1 = Count mode</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IN1_EVENT_FALL_EN</name>
	<description>0 = Rising edge event
1 = Falling edge event
it should be written when TIMER1_GPIO1_CONF=0 to prevent false events</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_GPIO1_CONF</name>
	<description>0,13,14,15 = IN1 is not used
1..12 = Defines the P0 pin (0..11) module will use as IN1</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER1_CLR_EVENT_REG</name>
	<description>Clear event register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>TIMER1_CLR_IN2_EVENT</name>
	<description>Write 1 to clear the TIMER1_IN2_EVENT and TIMER1_IN2_OVRFLW</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_CLR_IN1_EVENT</name>
	<description>Write 1 to clear the TIMER1_IN1_EVENT and TIMER1_IN1_OVRFLW</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_CLR_TIMER_EVENT</name>
	<description>Write 1 to clear the TIMER1_TIMER_EVENT</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER1_CTRL_REG</name>
	<description>Timer1 control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0001ffff</resetMask>
	<fields><field>
	<name>TIMER1_CLK_EN</name>
	<description>0 = timer1 clock is disabled
1 = timer1 clock is enabled</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_USE_SYS_CLK</name>
	<description>0 = Timer1 use the clock LP clock
1 = Timer1 use the system clock</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_FREE_RUN_MODE_EN</name>
	<description>Applicable when timer counts up
1 = timer1 goes to zero when it reaches the max value.
0 = timer1 goes to zero when it reaches the reload value.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_IRQ_EN</name>
	<description>0 = timer1 IRQ masked
1 = timer1 IRQ unmasked</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_COUNT_DOWN_EN</name>
	<description>0 = timer1 counts up
1 = timer1 counts down</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_ENABLE</name>
	<description>0 = Timer1 disabled
1 = Timer1 enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIMER1_RELOAD</name>
	<description>Reload or max value in timer mode. Actual delay is the register value plus synchronization time (3 clock cycles)</description>
	<bitRange>[10:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER1_STATUS_REG</name>
	<description>Timer1 counter value</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>TIMER1_IN2_OVRFLW</name>
	<description>1 = New IN2 event occurred while Interrupt was pending.
TIMER1_CAPCNT2_VALUE_REG gives the time stamp of the first event.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_IN1_OVRFLW</name>
	<description>1 = New IN1 event occurred while Interrupt was pending.
TIMER1_CAPCNT1_VALUE_REG gives the time stamp of the first event.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_IN2_EVENT</name>
	<description>1 = Pending Capture 2 interrupt. It has be clear writing 1 to TIMER1_CLR_IN2_EVENT</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_IN1_EVENT</name>
	<description>1 = Pending Capture 1 interrupt. It has be clear writing 1 to TIMER1_CLR_IN1_EVENT</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_TIMER_EVENT</name>
	<description>1 = Pending Timer interrupt. it has be clear writing 1' to TIMER1_CLR_TIMER_EVENT</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TIMER1_TIMER_VALUE</name>
	<description>Gives the current timer value</description>
	<bitRange>[10:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>UART</name>
	<version>1.0</version>
	<description>UART registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>256</size>
	<usage>registers</usage>
</addressBlock>
	
